RAKWireless/RAK-nRF52-RUI/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=Bootloader
menu.debug=Debug
menu.supportnfc=Support NFC
menu.supportat=Support AT
menu.supportlora=Support LoRaWAN
menu.supportAS923=Support LoRaWAN Region AS923
menu.supportAU915=Support LoRaWAN Region AU915
menu.supportCN470=Support LoRaWAN Region CN470
menu.supportCN779=Support LoRaWAN Region CN779
menu.supportEU433=Support LoRaWAN Region EU433
menu.supportEU868=Support LoRaWAN Region EU868
menu.supportKR920=Support LoRaWAN Region KR920
menu.supportIN865=Support LoRaWAN Region IN865
menu.supportUS915=Support LoRaWAN Region US915
menu.supportRU864=Support LoRaWAN Region RU864
menu.supportLA915=Support LoRaWAN Region LA915
# ----------------------------------
# WisBlock Core RAK4630 Board
# ----------------------------------
WisCoreRAK4631Board.name=WisBlock Core RAK4631 Board
WisCoreRAK4631Board.bootloader.tool=bootburn
WisCoreRAK4631Board.build.variant_h=variant_{build.board}.h
WisCoreRAK4631Board.build.series=rak4630

# Upload
WisCoreRAK4631Board.upload.tool=uploader
WisCoreRAK4631Board.upload.protocol=uploader
WisCoreRAK4631Board.upload.use_1200bps_touch=true
WisCoreRAK4631Board.upload.wait_for_upload_port=true
WisCoreRAK4631Board.upload.maximum_size=557056
WisCoreRAK4631Board.upload.maximum_data_size=206448

# Build
WisCoreRAK4631Board.build.mcu=cortex-m4
WisCoreRAK4631Board.build.f_cpu=64000000
WisCoreRAK4631Board.build.board=WisCore_RAK4631_Board
WisCoreRAK4631Board.build.core=nRF5
WisCoreRAK4631Board.build.variant=WisCore_RAK4631_Board
WisCoreRAK4631Board.build.usb_manufacturer="RAKwireless"
WisCoreRAK4631Board.build.usb_product="WisCore RAK4631 Board"
WisCoreRAK4631Board.build.extra_flags=-DNRF52840_XXAA -DRAK4631_V2.0+RAK5005-O_V1.0 -Drak4630 -DWISBLOCK_BASE_5005_O {build.flags.usb}
WisCoreRAK4631Board.build.flags.feature=-DLORA_IO_SPI_PORT=2 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DWAN_TYPE=0 -DLORA_STACK_VER=0x040407 -DBATTERY_LEVEL_SUPPORT -DBLE_CENTRAL_SUPPORT -DAPP_TIMER_V2 -DAPP_TIMER_V2_RTC1_ENABLED -DBOARD_PCA10056 -DS140 -DCONFIG_GPIO_AS_PINRESET -DFLOAT_ABI_HARD -DNRF52840_XXAA -DNRF_SD_BLE_API_VERSION=6 -DUSER_UART -DUSBD_CDC -DBLE_SUPPORT -DDFU_SUPPORT -DBL_SETTINGS_ACCESS_ONLY -DNRF_DFU_SVCI_ENABLED -DNRF_DFU_TRANSPORT_BLE=1 -DSOFT_SE -DSECURE_ELEMENT_PRE_PROVISIONED -DLORAMAC_CLASSB_ENABLED -DSOFTDEVICE_PRESENT -DSWI_DISABLE0 -D__HEAP_SIZE=7168 -D__STACK_SIZE=7168 -DDEBUG -DSUPPORT_USB -DSUPPORT_BLE -DSUPPORT_NFC -DSUPPORT_SPI -DSUPPORT_AT -DRUI_SDK
WisCoreRAK4631Board.build.flags.lib_path="-L{runtime.platform.path}/cores/nRF5/app" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840/uhal" "-L{runtime.platform.path}/cores/nRF5/external" "-L{runtime.platform.path}/cores/nRF5/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/nRF5/component/udrv/serial" "-L{runtime.platform.path}/cores/nRF5/component/udrv/flash" "-L{runtime.platform.path}/cores/nRF5/component/udrv/timer" "-L{runtime.platform.path}/cores/nRF5/component/service/nvm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/system" "-L{runtime.platform.path}/cores/nRF5/component/udrv/powersave" "-L{runtime.platform.path}/cores/nRF5/component/udrv/wdt" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/service/lora" "-L{runtime.platform.path}/cores/nRF5/component/service/runtimeConfig" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/dfu" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pwm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/crypto" "-L{runtime.platform.path}/cores/nRF5/component/udrv/trng" "-L{runtime.platform.path}/cores/nRF5/component/udrv/adc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pdm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/spimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/ble" "-L{runtime.platform.path}/cores/nRF5/component/udrv/nfc" "-L{runtime.platform.path}/cores/nRF5/component/service/battery" "-L{runtime.platform.path}/cores/nRF5/component/service/mode" "-L{runtime.platform.path}/cores/nRF5/component/service/debug" "-L{runtime.platform.path}/cores/nRF5/component/rui_v3_api" "-L{runtime.platform.path}/cores/nRF5/component/fund/event_queue" "-L{runtime.platform.path}/cores/nRF5/component/fund/circular_queue" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_cc310/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_oberon/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/t4t_lib" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
