RAKWireless/RAK-nRF52-RUI/boards.txt
WisTrioRAK5010Board.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_library/rak1901/RAKwireless_RAK1901_Temperature_and_Humidity_SHTC3/src" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_library/rak1902/RAKwireless_RAK1902_Pressure_LPS22HB/src" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_library/rak1903/RAKwireless_RAK1903_Optical_OPT3001/src" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_library/rak1904/RAKwireless_RAK1904_Accelerate_LIS3DH/src" "-I{runtime.platform.path}/cores/nRF5/app/RAK5010/src" "-I{runtime.platform.path}/cores/nRF5/component/inc" "-I{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840" "-I{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840/uhal" "-I{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840/uhal/serial" "-I{runtime.platform.path}/cores/nRF5/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/nRF5/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/nRF5/component/udrv" "-I{runtime.platform.path}/cores/nRF5/component/udrv/serial" "-I{runtime.platform.path}/cores/nRF5/component/udrv/timer" "-I{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-I{runtime.platform.path}/cores/nRF5/component/udrv/spimst" "-I{runtime.platform.path}/cores/nRF5/component/udrv/powersave" "-I{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-I{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-I{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-I{runtime.platform.path}/cores/nRF5/component/udrv/dfu" "-I{runtime.platform.path}/cores/nRF5/component/udrv/crypto" "-I{runtime.platform.path}/cores/nRF5/component/udrv/trng" "-I{runtime.platform.path}/cores/nRF5/component/udrv/pwm" "-I{runtime.platform.path}/cores/nRF5/component/udrv/adc" "-I{runtime.platform.path}/cores/nRF5/component/udrv/system" "-I{runtime.platform.path}/cores/nRF5/component/udrv/ble" "-I{runtime.platform.path}/cores/nRF5/component/udrv/flash" "-I{runtime.platform.path}/cores/nRF5/component/udrv/wdt" "-I{runtime.platform.path}/cores/nRF5/component/udrv/nfc" "-I{runtime.platform.path}/cores/nRF5/component/udrv/pdm" "-I{runtime.platform.path}/cores/nRF5/component/service/nvm" "-I{runtime.platform.path}/cores/nRF5/component/service/battery" "-I{runtime.platform.path}/cores/nRF5/component/service/debug" "-I{runtime.platform.path}/cores/nRF5/component/service/mode" "-I{runtime.platform.path}/cores/nRF5/component/service/mode/cli" "-I{runtime.platform.path}/cores/nRF5/component/service/mode/transparent" "-I{runtime.platform.path}/cores/nRF5/component/service/mode/protocol" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_api" "-I{runtime.platform.path}/cores/nRF5/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/nRF5/component/fund/event_queue" "-I{runtime.platform.path}/cores/nRF5/component/fund/circular_queue" "-I{runtime.platform.path}/cores/nRF5/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/log" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/ringbuf" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/log/src" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/memobj" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/mutex" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/softdevice/s140/headers" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/softdevice/s140/headers/nrf52" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/nrf_ble_scan" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/serial" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/queue" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/RUI/Source/nordic/service/wdt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/drivers/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/hal" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/integration/nrfx/legacy" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/usbd" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/usbd/class/cdc/acm" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/usbd/class/cdc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/utf_converter" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/drivers_nrf/usbd" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bootloader" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bootloader/ble_dfu" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bootloader/dfu" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/pwr_mgmt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/svc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/mutex" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/RUI/Source/nordic/app" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/integration/nrfx/legacy" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/strerror" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/fstorage" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/softdevice/common" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/util/" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_link_ctx_manager" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/atomic/" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/atomic_flags" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_db_discovery" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/nrf_ble_gatt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/balloc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/boards" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/peer_manager" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/softdevice/common" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/common" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_nus" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_nus_c" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_link_ctx_manager" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_advertising" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/atomic_flags" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/timer" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/fds" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/fifo" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/atomic" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/atomic_fifo" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/uart" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/fstorage" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crc32" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/sha256" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/cc310" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/cc310_bl" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/nrf_sw" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/mbedtls" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/oberon" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/micro_ecc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bootloader/dfu" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/nrf_ble_gatt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/uart/" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/mdk" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/RUI/build/nordic/RTE" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/hal" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/drivers/src/prs" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/balloc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/delay" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/integration/nrfx" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bsp" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/segger_rtt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/RUI/Source/nordic/include" "-I{runtime.platform.path}/cores/nRF5/external/micro_ecc" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/strerror" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/boards" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/toolchain/cmsis/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/util" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/fprintf" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/segger_rtt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/drivers/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/util" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_advertising" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/fds" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/button" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bsp" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/drivers/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/hal/" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/RUI/Source/nordic/service/ble_central" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_db_discovery" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/bootloader" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/pwr_mgmt" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/mutex" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/pwm" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/nrf_ble_gq" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/optiga" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/nrf_hw" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/mbedtls/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/mbedtls/include/mbedtls" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/crypto/backend/cifra" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/stack_info" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/sortlist" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/timer" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/cli" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/cli/uart" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/nrf_ble_qwr" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_hids" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_bas" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/ble/ble_services/ble_dis" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/sensorsim" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/scheduler" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_cc310_bl/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/mutex" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_cc310/include" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/t4t_lib" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/ndef/generic/message" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/ndef/text" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/ndef/uri" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/ndef/launchapp" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/ndef/generic/record" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/hardfault" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/modules/nrfx/drivers/src" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/nfc/platform" "-I{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/components/libraries/hardfault/nrf52" "-I{runtime.platform.path}/cores/nRF5/external/FatFs/source" "-I{runtime.platform.path}/cores/nRF5/external/spiffs/src"
WisTrioRAK5010Board.build.flags.lib=-lnrf_cc310_0.9.13 -loberon_3.0.6
