RAKWireless/RAK-nRF52-RUI/boards.txt
# SoftDevice Menu
WisTrioRAK5010Board.menu.softdevice.s140v6=0.3.2 SoftDevice s140 7.2.0
WisTrioRAK5010Board.menu.softdevice.s140v6.build.sd_name=s140
WisTrioRAK5010Board.menu.softdevice.s140v6.build.sd_version=7.2.0
WisTrioRAK5010Board.menu.softdevice.s140v6.build.sd_fwid=0x0100

# Debug Menu
WisTrioRAK5010Board.menu.debug.l0=Level 0 (Release)
WisTrioRAK5010Board.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisTrioRAK5010Board.menu.debug.l1=Level 1 (Error Message)
WisTrioRAK5010Board.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisTrioRAK5010Board.menu.debug.l2=Level 2 (Full Debug)
WisTrioRAK5010Board.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisTrioRAK5010Board.menu.debug.l3=Level 3 (Segger SystemView)
WisTrioRAK5010Board.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisTrioRAK5010Board.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# BG96 AUTOREAD Menu
menu.auto_display_cellular_response=Auto Display Cellular Response

WisTrioRAK5010Board.menu.auto_display_cellular_response.1=Off
WisTrioRAK5010Board.menu.auto_display_cellular_response.1.build.bg96_flag=-UAUTO_DISPLAY_CELLULAR_RESPONSE
WisTrioRAK5010Board.menu.auto_display_cellular_response.2=On
WisTrioRAK5010Board.menu.auto_display_cellular_response.2.build.bg96_flag=-DAUTO_DISPLAY_CELLULAR_RESPONSE

WisTrioRAK5010Board.menu.supportat.1=On
WisTrioRAK5010Board.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisTrioRAK5010Board.menu.supportat.2=Off
WisTrioRAK5010Board.menu.supportat.2.build.support_at_flag=-USUPPORT_AT


# ----------------------------------
# WisBlock Core RAK3400 Board
# ----------------------------------
WisCoreRAK3401Board.name=WisBlock Core RAK3401 Board
WisCoreRAK3401Board.bootloader.tool=bootburn
WisCoreRAK3401Board.build.variant_h=variant_{build.board}.h
WisCoreRAK3401Board.build.series=rak3400

# Upload
WisCoreRAK3401Board.upload.tool=uploader
WisCoreRAK3401Board.upload.protocol=uploader
WisCoreRAK3401Board.upload.use_1200bps_touch=true
WisCoreRAK3401Board.upload.wait_for_upload_port=true
WisCoreRAK3401Board.upload.maximum_size=557056
WisCoreRAK3401Board.upload.maximum_data_size=206448

# Build
WisCoreRAK3401Board.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
WisCoreRAK3401Board.build.f_cpu=64000000
WisCoreRAK3401Board.build.board=WisCore_RAK3401_Board
WisCoreRAK3401Board.build.core=nRF5
WisCoreRAK3401Board.build.variant=WisCore_RAK3401_Board
WisCoreRAK3401Board.build.usb_manufacturer="RAKwireless"
WisCoreRAK3401Board.build.usb_product="WisCore RAK3401 Board"
WisCoreRAK3401Board.build.extra_flags=-DNRF52840_XXAA -DRAK3401_V2.0+RAK5005-O_V1.0 -Drak3400 -DWISBLOCK_BASE_5005_O {build.flags.usb}
WisCoreRAK3401Board.build.flags.feature=-DNO_LORA_SUPPORT -DLORA_IO_SPI_PORT=2 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DBATTERY_LEVEL_SUPPORT -DBLE_CENTRAL_SUPPORT -DAPP_TIMER_V2 -DAPP_TIMER_V2_RTC1_ENABLED -DBOARD_PCA10056 -DS140 -DCONFIG_GPIO_AS_PINRESET -DFLOAT_ABI_HARD -DNRF52840_XXAA -DNRF_SD_BLE_API_VERSION=6 -DUSER_UART -DUSBD_CDC -DBLE_SUPPORT -DDFU_SUPPORT -DBL_SETTINGS_ACCESS_ONLY -DNRF_DFU_SVCI_ENABLED -DNRF_DFU_TRANSPORT_BLE=1 -DSOFT_SE -DSECURE_ELEMENT_PRE_PROVISIONED -DSOFTDEVICE_PRESENT -DSWI_DISABLE0 -D__HEAP_SIZE=7168 -D__STACK_SIZE=7168 -DDEBUG -DWISBLOCK_BASE_5005_O -DSUPPORT_USB -DSUPPORT_BLE -DSUPPORT_NFC -DSUPPORT_SPI -DSUPPORT_AT -DRUI_SDK
WisCoreRAK3401Board.build.flags.lib_path="-L{runtime.platform.path}/cores/nRF5/app" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840" "-L{runtime.platform.path}/cores/nRF5/component/core/mcu/nrf52840/uhal" "-L{runtime.platform.path}/cores/nRF5/external" "-L{runtime.platform.path}/cores/nRF5/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/nRF5/component/udrv/serial" "-L{runtime.platform.path}/cores/nRF5/component/udrv/flash" "-L{runtime.platform.path}/cores/nRF5/component/udrv/timer" "-L{runtime.platform.path}/cores/nRF5/component/service/nvm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/system" "-L{runtime.platform.path}/cores/nRF5/component/udrv/powersave" "-L{runtime.platform.path}/cores/nRF5/component/udrv/wdt" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/delay" "-L{runtime.platform.path}/cores/nRF5/component/udrv/gpio" "-L{runtime.platform.path}/cores/nRF5/component/udrv/rtc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/twimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/dfu" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pwm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/crypto" "-L{runtime.platform.path}/cores/nRF5/component/udrv/trng" "-L{runtime.platform.path}/cores/nRF5/component/udrv/adc" "-L{runtime.platform.path}/cores/nRF5/component/udrv/pdm" "-L{runtime.platform.path}/cores/nRF5/component/udrv/spimst" "-L{runtime.platform.path}/cores/nRF5/component/udrv/ble" "-L{runtime.platform.path}/cores/nRF5/component/udrv/nfc" "-L{runtime.platform.path}/cores/nRF5/component/service/battery" "-L{runtime.platform.path}/cores/nRF5/component/service/mode" "-L{runtime.platform.path}/cores/nRF5/component/service/debug" "-L{runtime.platform.path}/cores/nRF5/component/rui_v3_api" "-L{runtime.platform.path}/cores/nRF5/component/fund/event_queue" "-L{runtime.platform.path}/cores/nRF5/component/fund/circular_queue" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_cc310/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/cores/nRF5/external/nRF5_SDK/nRF5_SDK_17.0.2_d674dde/external/nrf_oberon/lib/cortex-m4/hard-float" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
